In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [ ]:
%sql SELECT song_id,artist_id,count(song_id) as id_with_value FROM songplay GROUP BY (song_id,artist_id) LIMIT 15;

In [ ]:
%sql SELECT * FROM songplay LIMIT 15;

In [23]:
%sql SELECT * FROM dimUsers LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(91, 'Jayden', 'Bell', 'M', 'free'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (86, 'Aiden', 'Hess', 'M', 'free'),
 (24, 'Layla', 'Griffin', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free')]

In [5]:
%sql SELECT * FROM dimSongs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179000000001')),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, Decimal('266.39627999999999')),
 ('SOIAZJW12AB01853F1', 'Pink World', 'AR8ZCNI1187B9A069B', 1984, Decimal('269.81832000000003')),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, Decimal('189.57015999999999')),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, Decimal('148.03546'))]

In [5]:
%sql SELECT * FROM dimArtists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARNTLGG11E2835DDB9', 'Clp', '', Decimal('NaN'), Decimal('NaN')),
 ('AR8ZCNI1187B9A069B', 'Planet P Project', '', Decimal('NaN'), Decimal('NaN')),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.149679999999996'), Decimal('-90.048919999999995'))]

In [24]:
%sql SELECT * FROM dimTimes LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1543537327, 0, 1, 1, 1, 1970, '3'),
 (1543540121, 0, 1, 1, 1, 1970, '3'),
 (1543540368, 0, 1, 1, 1, 1970, '3'),
 (1543540625, 0, 1, 1, 1, 1970, '3'),
 (1543540856, 0, 1, 1, 1, 1970, '3')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

Example queries

Number of free users and paid users

In [ ]:
%sql SELECT level, COUNT (level) FROM songplay GROUP BY level ;

What hour has the highest traffic

In [ ]:
%sql SELECT dimTimes.hour, COUNT (dimTimes.hour) AS hour_count FROM (songplay JOIN dimTimes ON \
                                    songplay.start_time=dimTimes.start_time)\
            GROUP BY dimTimes.hour  ORDER BY hour_count DESC;

How many songs were played by each user?

In [ ]:
%sql SELECT songplay.user_id, songplay.level, COUNT (songplay.song_id) AS user_count FROM (songplay JOIN dimUsers ON \
                                    songplay.user_id=dimUsers.user_id)\
            GROUP BY songplay.user_id, songplay.level  ORDER BY user_count DESC LIMIT 15;

How many songs were played from the most played artist?

In [ ]:
%sql SELECT songplay.artist_id, dimArtists.artist_name, COUNT (songplay.artist_id) AS artistcount FROM (songplay JOIN dimArtists ON \
                                    songplay.artist_id=dimArtists.artist_id)\
            GROUP BY songplay.artist_id,dimArtists.artist_name  ORDER BY artistcount DESC LIMIT 5;